/**
 * 求众数
 *
 * 给定一个大小为 n 的数组，找到其中的众数。众数是指在数组中出现次数大于 ⌊ n/2 ⌋ 的元素。
   你可以假设数组是非空的，并且给定的数组总是存在众数。
     示例 1:
     输入: [3,2,3]
     输出: 3

     示例 2:
     输入: [2,2,1,1,1,2,2]
     输出: 2

    说明：
     我们现将数组中的第一个数假设为众数，然后进行统计其出现的次数，如果遇到同样的数，则计数器自增 1，
     否则计数器自减 1，如果计数器减到了 0，则更换当前数字为候选者。这是一个很巧妙的设定，
     也是本算法的精髓所在，为什么遇到不同的数字时计数器要减 1，为什么减到 0 了又要更换候选者呢？
     首先是有那个强大的前提存在，一定会有一个出现次数超过半数的数字存在，那么如果计数器减到 0 了，
     说明目前不是候选者数字的个数已经跟候选者的出现个数相同了，那么这个候选者已经很 weak 了，
     不一定能出现超过半数，我们选择更换当前的候选者。那有可能你会有疑问，那万一后面又大量的出现了
     之前的候选者怎么办，不需要担心，如果之前的候选者在后面大量出现的话，其又会重新变为候选者，
     直到最终验证成为正确的众数

 */
function majorityElement(nums) {
  let count = 1;
  let res = nums[0];

  for (let i = 1; i < nums.length; i++) {
    if (nums[i] === res) {
      count++;
    } else {
      count--;
      if (count === 0) {
        res = nums[i];
        count++;
      }
    }
  }
  return res;
}
